leihen0525/Master.Drivers.STM32F407/Drivers.STM32F407.Ether/Drivers.STM32F4xx.Ether.MAC.c
/*
 * Drivers.STM32F4xx.Ether.MAC.c
 *
 *  Created on: 2019年5月21日
 *      Author: Master.HE
 */
#include "Error.h"
#include "STM32F4xx.h"
#include "Drivers.STM32F4xx.Ether.MAC.Define.h"
#include "Drivers.STM32F4xx.Ether.MAC.h"
#include "Drivers.STM32F4xx.Ether.PHY.h"


#pragma data_alignment=4
ETH_DMADESCTypeDef  DMARxDscrTab[ETH_RXBUFNB];/* Ethernet Rx MA Descriptor */
#pragma data_alignment=4
ETH_DMADESCTypeDef  DMATxDscrTab[ETH_TXBUFNB];/* Ethernet Tx DMA Descriptor */
#pragma data_alignment=4
uint8_t Rx_Buff[ETH_RXBUFNB][ETH_MAX_PACKET_SIZE]; /* Ethernet Receive Buffer */
#pragma data_alignment=4
uint8_t Tx_Buff[ETH_TXBUFNB][ETH_MAX_PACKET_SIZE]; /* Ethernet Transmit Buffer */



void Drivers_STM32F4xx_Ether_MAC_GPIO_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;

	/* Enable GPIOs clocks */
	RCC_AHB1PeriphClockCmd(
			 ETH_MDIO_GPIO_CLK
			|ETH_MDC_GPIO_CLK
			|ETH_RMII_REF_CLK_GPIO_CLK
			|ETH_RMII_CRS_DV_GPIO_CLK
			|ETH_RMII_RXD0_GPIO_CLK
			|ETH_RMII_RXD1_GPIO_CLK
			|ETH_RMII_TX_EN_GPIO_CLK
			|ETH_RMII_TXD0_GPIO_CLK
			|ETH_RMII_TXD1_GPIO_CLK
			|RCC_AHB1Periph_GPIOD,
			ENABLE);

	/* Enable SYSCFG clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);


	/* MII/RMII Media interface selection --------------------------------------*/
#ifdef MII_MODE /* Mode MII with STM324xG-EVAL  */
#ifdef PHY_CLOCK_MCO

	/* Output HSE clock (25MHz) on MCO pin (PA8) to clock the PHY */
	RCC_MCO1Config(RCC_MCO1Source_HSE, RCC_MCO1Div_1);

#endif /* PHY_CLOCK_MCO */

	SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_MII);

#elif defined RMII_MODE  /* Mode RMII with STM324xG-EVAL */

	SYSCFG_ETH_MediaInterfaceConfig(SYSCFG_ETH_MediaInterface_RMII);

#endif

	/* Ethernet pins configuration ************************************************/
	/*
	ETH_MDIO -------------------------> PA2
	ETH_MDC --------------------------> PC1
	ETH_MII_RX_CLK/ETH_RMII_REF_CLK---> PA1
	ETH_MII_RX_DV/ETH_RMII_CRS_DV ----> PA7
	ETH_MII_RXD0/ETH_RMII_RXD0 -------> PC4
	ETH_MII_RXD1/ETH_RMII_RXD1 -------> PC5
	ETH_MII_TX_EN/ETH_RMII_TX_EN -----> PB11
	ETH_MII_TXD0/ETH_RMII_TXD0 -------> PG13
	ETH_MII_TXD1/ETH_RMII_TXD1 -------> PG14
	ETH_NRST -------------------------> PI1
	  */

	/* Configure ETH_MDIO */
	GPIO_InitStructure.GPIO_Pin = ETH_MDIO_PIN;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(ETH_MDIO_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_MDIO_PORT, ETH_MDIO_SOURCE, ETH_MDIO_AF);

	/* Configure ETH_MDC */
	GPIO_InitStructure.GPIO_Pin = ETH_MDC_PIN;
	GPIO_Init(ETH_MDC_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_MDC_PORT, ETH_MDC_SOURCE, ETH_MDC_AF);

	/* Configure ETH_RMII_REF_CLK */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_REF_CLK_PIN;
	GPIO_Init(ETH_RMII_REF_CLK_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_REF_CLK_PORT, ETH_RMII_REF_CLK_SOURCE, ETH_RMII_REF_CLK_AF);

	/* Configure ETH_RMII_CRS_DV */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_CRS_DV_PIN;
	GPIO_Init(ETH_RMII_CRS_DV_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_CRS_DV_PORT, ETH_RMII_CRS_DV_SOURCE, ETH_RMII_CRS_DV_AF);

	/* Configure ETH_RMII_RXD0 */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_RXD0_PIN;
	GPIO_Init(ETH_RMII_RXD0_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_RXD0_PORT, ETH_RMII_RXD0_SOURCE, ETH_RMII_RXD0_AF);

	/* Configure ETH_RMII_RXD1 */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_RXD1_PIN;
	GPIO_Init(ETH_RMII_RXD1_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_RXD1_PORT, ETH_RMII_RXD1_SOURCE, ETH_RMII_RXD1_AF);

	/* Configure ETH_RMII_TX_EN */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_TX_EN_PIN;
	GPIO_Init(ETH_RMII_TX_EN_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_TX_EN_PORT, ETH_RMII_TX_EN_SOURCE, ETH_RMII_TX_EN_AF);

	/* Configure ETH_RMII_TXD0 */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_TXD0_PIN;
	GPIO_Init(ETH_RMII_TXD0_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_TXD0_PORT, ETH_RMII_TXD0_SOURCE, ETH_RMII_TXD0_AF);

	/* Configure ETH_RMII_TXD1 */
	GPIO_InitStructure.GPIO_Pin = ETH_RMII_TXD1_PIN;
	GPIO_Init(ETH_RMII_TXD1_PORT, &GPIO_InitStructure);
	GPIO_PinAFConfig(ETH_RMII_TXD1_PORT, ETH_RMII_TXD1_SOURCE, ETH_RMII_TXD1_AF);

	//配置PD3为推完输出
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;	//推完输出
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL ;
	GPIO_Init(GPIOD, &GPIO_InitStructure);




}
int Drivers_STM32F4xx_Ether_MAC_Init(void)
{
	/* Enable ETHERNET clock  */
	RCC_AHB1PeriphClockCmd(
			 RCC_AHB1Periph_ETH_MAC
			|RCC_AHB1Periph_ETH_MAC_Tx
			|RCC_AHB1Periph_ETH_MAC_Rx,
			ENABLE);

	/* Reset ETHERNET on AHB Bus */
	RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, ENABLE);
	RCC_AHB1PeriphResetCmd(RCC_AHB1Periph_ETH_MAC, DISABLE);

	Drivers_STM32F4xx_Ether_MAC_Software_Reset();

	Drivers_STM32F4xx_Ether_PHY_SET_Clock();


	//------------------------------------
	ETH->MACCR_BIT.WD=1;//0;/* MAC watchdog enabled: cuts off long frame */
	ETH->MACCR_BIT.JD=1;//0;/* MAC Jabber enabled in Half-duplex mode */
	ETH->MACCR_BIT.IFG=0;/* Ethernet interframe gap set to 96 bits */
	ETH->MACCR_BIT.CSD=0;/* Carrier Sense Enabled in Half-Duplex mode */
	ETH->MACCR_BIT.FES=1;/* PHY speed configured to 100Mbit/s */
	ETH->MACCR_BIT.ROD=0;/* Receive own Frames in Half-Duplex mode enabled */


	ETH->MACCR_BIT.LM=0;/* 关闭反馈 */

	ETH->MACCR_BIT.DM=1;/* Full-Duplex mode selected */

	ETH->MACCR_BIT.IPCO=1;/* 开启ipv4和TCP/UDP/ICMP的帧校验和卸载   */

	ETH->MACCR_BIT.RD=1;/* 关闭重传功能 */

	ETH->MACCR_BIT.APCS=0;/* 关闭自动去除PDA/CRC功能  */

	ETH->MACCR_BIT.BL=0;/* half-duplex mode retransmission Backoff time_limit = 10 slot times*/

	ETH->MACCR_BIT.DC=0;/* half-duplex mode Deferral check disabled */


	//---------------------------------------
	ETH->MACFFR_BIT.RA=0;/* 关闭接收所有的帧 */

	ETH->MACFFR_BIT.SAF=0;/* Source address filtering (on the optional MAC addresses) disabled */
	ETH->MACFFR_BIT.SAIF=0;

	ETH->MACFFR_BIT.PCF=1;/* Do not forward control frames that do not pass the address filtering */

	ETH->MACFFR_BIT.BFD=0;/* 允许接收所有广播帧 */

	ETH->MACFFR_BIT.DAIF=0;/* Normal Destination address filtering (not reverse addressing) */

	ETH->MACFFR_BIT.HM=0;/* 对于组播地址使用完美地址过滤    */
	ETH->MACFFR_BIT.PAM=0;
	ETH->MACFFR_BIT.HPF=0;

