leihen0525/Master.Drivers.STM32F407/Drivers.STM32F407.Ether/Drivers.STM32F4xx.Ether.MAC.c
	ETH->MACFFR_BIT.HU=0;/* 对单播地址使用完美地址过滤  */
	ETH->MACFFR_BIT.HPF=0;

	ETH->MACFFR_BIT.PM=0;/* 关闭混合模式的地址过滤  */


	//----------------------------------------------
	ETH->MACHTHR = 0;
	ETH->MACHTLR = 0;

	//----------------------------------------------
	ETH->MACFCR_BIT.PT=0;/* Flow control config (flow control disabled)*/
	ETH->MACFCR_BIT.ZQPD=1;
	ETH->MACFCR_BIT.PLT=0;
	ETH->MACFCR_BIT.UPFD=0;
	ETH->MACFCR_BIT.RFCE=0;
	ETH->MACFCR_BIT.TFCE=0;


	//----------------------------------------------
	ETH->MACVLANTR_BIT.VLANTC=0;
	ETH->MACVLANTR_BIT.VLANTI=0;


	//----------------------------------------------
	ETH->DMAOMR_BIT.DTCEFD=0;/* 开启丢弃TCP/IP错误帧 */
	ETH->DMAOMR_BIT.RSF=1;/* 开启接收数据的存储转发模式  */
	ETH->DMAOMR_BIT.DFRF=0;/* Flush received frame that created FIFO overflow */
	ETH->DMAOMR_BIT.TSF=1;/* 开启发送数据的存储转发模式   */
	ETH->DMAOMR_BIT.TTC=0;/* Threshold TXFIFO level set to 64 bytes (used when threshold mode is enabled) */
	ETH->DMAOMR_BIT.FEF=0;/* 禁止转发错误帧 */
	ETH->DMAOMR_BIT.FUGF=0;/* 不转发过小的好帧 */
	ETH->DMAOMR_BIT.RTC1=0;
	ETH->DMAOMR_BIT.OSF=1;/* 打开处理第二帧功能 */

	//-----------------------------------------------
	ETH->DMABMR_BIT.AAB=1;/* 开启DMA传输的地址对齐功能 */
	ETH->DMABMR_BIT.FB=1;/* 开启固定突发功能 */
	ETH->DMABMR_BIT.RDP=32;/*DMA接收的最大突发长度为32个节拍 */
	ETH->DMABMR_BIT.PBL=32;/* DMA发送的最大突发长度为32个节拍 */
	ETH->DMABMR_BIT.DSL=0;/* DMA Ring mode skip length = 0 */

	ETH->DMABMR_BIT.PM=1;
	ETH->DMABMR_BIT.DA=0;


	//-------------------------------------------------
	ETH->DMABMR_BIT.EDFE=1;//开启扩展标识符


	//-------------------------------------------------

	ETH_DMATxDescChainInit();
	ETH_DMARxDescChainInit();

	/* Enable the TCP, UDP and ICMP checksum insertion for the Tx frames */
	for(int i=0; i<ETH_TXBUFNB; i++)
	{
		//DMATxDscrTab[i].DES0|=ETH_DMATxDesc_ChecksumTCPUDPICMPFull;
	}


	//IRQ
	ETH->DMAIER_BIT.NISE=1;
	ETH->DMAIER_BIT.RIE=1;
	ETH->DMAIER_BIT.TIE=1;
	ETH->DMAIER_BIT.ETIE=1;
	ETH->DMAIER_BIT.ERIE=1;

	return Error_OK;

#if 0
//
	  /*-------------------- PHY initialization and configuration ----------------*/
	int Err=Target_STM32F4xx_Ether_PHY_Reset_Register();
	uint16_t PHYValue=0;
	__IO uint32_t timeout = 0;


	if(Err!=Error_OK)
	{
		goto error;
	}

	Target_STM32F4xx_Ether_PHY_Read(ETHERNET_PHY_ADDRESS, PHY_BCR,&PHYValue);
	//Target_STM32F4xx_Ether_PHY_Write(ETHERNET_PHY_ADDRESS, PHY_BCR, PHY_AutoNegotiation);


	if(1)/* 开启网络自适应功能 */
	{
		/* We wait for linked status...*/
		do
		{
			timeout++;
			if((Err=Target_STM32F4xx_Ether_PHY_Read(ETHERNET_PHY_ADDRESS, PHY_BSR,&PHYValue))!=Error_OK)
			{
				goto error;
			}
		} while (1 && (timeout < PHY_READ_TO));

		/* Return ERROR in case of timeout */
		if(timeout == PHY_READ_TO)
		{
			Err = Error_Time_Out;
			goto error;
		}

		/* Reset Timeout counter */
		timeout = 0;
		/* Enable Auto-Negotiation */
		if((Err=Target_STM32F4xx_Ether_PHY_Write(ETHERNET_PHY_ADDRESS, PHY_BCR, PHY_AutoNegotiation))!=Error_OK)
		{
		/* Return ERROR in case of write timeout */
		//err = ETH_ERROR;
		}

		/* Wait until the auto-negotiation will be completed */
		do
		{
			timeout++;
			if((Err=Target_STM32F4xx_Ether_PHY_Read(ETHERNET_PHY_ADDRESS, PHY_BSR,&PHYValue))!=Error_OK)
			{
				goto error;
			}
		} while (!(PHYValue & PHY_AutoNego_Complete) && (timeout < (uint32_t)PHY_READ_TO));

		/* Return ERROR in case of timeout */
		if(timeout == PHY_READ_TO)
		{
			Err = Error_Time_Out;
			goto error;
		}

		/* Reset Timeout counter */
		timeout = 0;
		/* Read the result of the auto-negotiation */
		Target_STM32F4xx_Ether_PHY_Read(ETHERNET_PHY_ADDRESS, PHY_SR,&PHYValue);


		/* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
		if((PHYValue & PHY_DUPLEX_STATUS) != (uint32_t)RESET)
		{
			/* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
			//ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;
		}
		else
		{
			/* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
			//ETH_InitStruct->ETH_Mode = ETH_Mode_HalfDuplex;
		}
		/* Configure the MAC with the speed fixed by the auto-negotiation process */
		if(PHYValue & PHY_SPEED_STATUS)
		{
			/* Set Ethernet speed to 10M following the auto-negotiation */
			//ETH_InitStruct->ETH_Speed = ETH_Speed_10M;
		}
		else
		{
			/* Set Ethernet speed to 100M following the auto-negotiation */
			//ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
		}
	}
	else
	{
//		if(!ETH_WritePHYRegister(ETHERNET_PHY_ADDRESS, PHY_BCR, ((uint16_t)(ETH_InitStruct->ETH_Mode >> 3) |
//										   (uint16_t)(ETH_InitStruct->ETH_Speed >> 1))))
//		{
//			/* Return ERROR in case of write timeout */
//			err = ETH_ERROR;
//		}
//		/* Delay to assure PHY configuration */
//		_eth_delay_(PHY_CONFIG_DELAY);
	}


error:
	if (Err != Error_OK) /* Auto-negotiation failed */
	{
		/* Set Ethernet duplex mode to Full-duplex */
		//ETH_InitStruct->ETH_Mode = ETH_Mode_FullDuplex;

		/* Set Ethernet speed to 100M */
		//ETH_InitStruct->ETH_Speed = ETH_Speed_100M;
	}



	/*------------------------ ETHERNET MACCR Configuration --------------------*/
	/* Get the ETHERNET MACCR value */
//	tmpreg = ETH->MACCR;
	/* Clear WD, PCE, PS, TE and RE bits */
//	tmpreg &= MACCR_CLEAR_MASK;
	/* Set the WD bit according to ETH_Watchdog value */
	/* Set the JD: bit according to ETH_Jabber value */
	/* Set the IFG bit according to ETH_InterFrameGap value */
	/* Set the DCRS bit according to ETH_CarrierSense value */
	/* Set the FES bit according to ETH_Speed value */
	/* Set the DO bit according to ETH_ReceiveOwn value */
	/* Set the LM bit according to ETH_LoopbackMode value */
	/* Set the DM bit according to ETH_Mode value */
	/* Set the IPCO bit according to ETH_ChecksumOffload value */
	/* Set the DR bit according to ETH_RetryTransmission value */
	/* Set the ACS bit according to ETH_AutomaticPadCRCStrip value */
	/* Set the BL bit according to ETH_BackOffLimit value */
	/* Set the DC bit according to ETH_DeferralCheck value */




//	tmpreg |= (uint32_t)(ETH_InitStruct->ETH_Watchdog |
//						ETH_InitStruct->ETH_Jabber |
//						ETH_InitStruct->ETH_InterFrameGap |
//						ETH_InitStruct->ETH_CarrierSense |
//						ETH_InitStruct->ETH_Speed |
//						ETH_InitStruct->ETH_ReceiveOwn |
//						ETH_InitStruct->ETH_LoopbackMode |
//						ETH_InitStruct->ETH_Mode |
//						ETH_InitStruct->ETH_ChecksumOffload |
//						ETH_InitStruct->ETH_RetryTransmission |
//						ETH_InitStruct->ETH_AutomaticPadCRCStrip |
//						ETH_InitStruct->ETH_BackOffLimit |
//						ETH_InitStruct->ETH_DeferralCheck);
	/* Write to ETHERNET MACCR */
//	ETH->MACCR = (uint32_t)tmpreg;

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->MACCR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->MACCR = tmpreg;

	/*----------------------- ETHERNET MACFFR Configuration --------------------*/
	/* Set the RA bit according to ETH_ReceiveAll value */
	/* Set the SAF and SAIF bits according to ETH_SourceAddrFilter value */
	/* Set the PCF bit according to ETH_PassControlFrames value */
	/* Set the DBF bit according to ETH_BroadcastFramesReception value */
	/* Set the DAIF bit according to ETH_DestinationAddrFilter value */
	/* Set the PR bit according to ETH_PromiscuousMode value */
	/* Set the PM, HMC and HPF bits according to ETH_MulticastFramesFilter value */
	/* Set the HUC and HPF bits according to ETH_UnicastFramesFilter value */
	/* Write to ETHERNET MACFFR */



