leihen0525/Master.Drivers.STM32F407/Drivers.STM32F407.Ether/Drivers.STM32F4xx.Ether.MAC.c
//	ETH->MACFFR = (uint32_t)(ETH_InitStruct->ETH_ReceiveAll |
//							ETH_InitStruct->ETH_SourceAddrFilter |
//							ETH_InitStruct->ETH_PassControlFrames |
//							ETH_InitStruct->ETH_BroadcastFramesReception |
//							ETH_InitStruct->ETH_DestinationAddrFilter |
//							ETH_InitStruct->ETH_PromiscuousMode |
//							ETH_InitStruct->ETH_MulticastFramesFilter |
//							ETH_InitStruct->ETH_UnicastFramesFilter);

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->MACFFR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->MACFFR = tmpreg;


	/*--------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------*/
	/* Write to ETHERNET MACHTHR */


	/* Write to ETHERNET MACHTLR */


	/*----------------------- ETHERNET MACFCR Configuration --------------------*/

	/* Get the ETHERNET MACFCR value */
//	tmpreg = ETH->MACFCR;
	/* Clear xx bits */
//	tmpreg &= MACFCR_CLEAR_MASK;

	/* Set the PT bit according to ETH_PauseTime value */
	/* Set the DZPQ bit according to ETH_ZeroQuantaPause value */
	/* Set the PLT bit according to ETH_PauseLowThreshold value */
	/* Set the UP bit according to ETH_UnicastPauseFrameDetect value */
	/* Set the RFE bit according to ETH_ReceiveFlowControl value */
	/* Set the TFE bit according to ETH_TransmitFlowControl value */



//	tmpreg |= (uint32_t)((ETH_InitStruct->ETH_PauseTime << 16) |
//						ETH_InitStruct->ETH_ZeroQuantaPause |
//						ETH_InitStruct->ETH_PauseLowThreshold |
//						ETH_InitStruct->ETH_UnicastPauseFrameDetect |
//						ETH_InitStruct->ETH_ReceiveFlowControl |
//						ETH_InitStruct->ETH_TransmitFlowControl);
	/* Write to ETHERNET MACFCR */
//	ETH->MACFCR = (uint32_t)tmpreg;

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->MACFCR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->MACFCR = tmpreg;

	/*----------------------- ETHERNET MACVLANTR Configuration -----------------*/
	/* Set the ETV bit according to ETH_VLANTagComparison value */
	/* Set the VL bit according to ETH_VLANTagIdentifier value */

//	ETH->MACVLANTR = (uint32_t)(ETH_InitStruct->ETH_VLANTagComparison |
//							  ETH_InitStruct->ETH_VLANTagIdentifier);

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->MACVLANTR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->MACVLANTR = tmpreg;

	/*-------------------------------- DMA Config ------------------------------*/
	/*----------------------- ETHERNET DMAOMR Configuration --------------------*/

	/* Get the ETHERNET DMAOMR value */
//	tmpreg = ETH->DMAOMR;
	/* Clear xx bits */
//	tmpreg &= DMAOMR_CLEAR_MASK;

	/* Set the DT bit according to ETH_DropTCPIPChecksumErrorFrame value */
	/* Set the RSF bit according to ETH_ReceiveStoreForward value */
	/* Set the DFF bit according to ETH_FlushReceivedFrame value */
	/* Set the TSF bit according to ETH_TransmitStoreForward value */
	/* Set the TTC bit according to ETH_TransmitThresholdControl value */
	/* Set the FEF bit according to ETH_ForwardErrorFrames value */
	/* Set the FUF bit according to ETH_ForwardUndersizedGoodFrames value */
	/* Set the RTC bit according to ETH_ReceiveThresholdControl value */
	/* Set the OSF bit according to ETH_SecondFrameOperate value */



//	tmpreg |= (uint32_t)(ETH_InitStruct->ETH_DropTCPIPChecksumErrorFrame |
//								ETH_InitStruct->ETH_ReceiveStoreForward |
//								ETH_InitStruct->ETH_FlushReceivedFrame |
//								ETH_InitStruct->ETH_TransmitStoreForward |
//								ETH_InitStruct->ETH_TransmitThresholdControl |
//								ETH_InitStruct->ETH_ForwardErrorFrames |
//								ETH_InitStruct->ETH_ForwardUndersizedGoodFrames |
//								ETH_InitStruct->ETH_ReceiveThresholdControl |
//								ETH_InitStruct->ETH_SecondFrameOperate);
	/* Write to ETHERNET DMAOMR */
//	ETH->DMAOMR = (uint32_t)tmpreg;

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->DMAOMR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->DMAOMR = tmpreg;

	/*----------------------- ETHERNET DMABMR Configuration --------------------*/
	/* Set the AAL bit according to ETH_AddressAlignedBeats value */
	/* Set the FB bit according to ETH_FixedBurst value */
	/* Set the RPBL and 4*PBL bits according to ETH_RxDMABurstLength value */
	/* Set the PBL and 4*PBL bits according to ETH_TxDMABurstLength value */
	/* Set the DSL bit according to ETH_DesciptorSkipLength value */
	/* Set the PR and DA bits according to ETH_DMAArbitration value */



//	ETH->DMABMR = (uint32_t)(ETH_InitStruct->ETH_AddressAlignedBeats |
//						ETH_InitStruct->ETH_FixedBurst |
//						ETH_InitStruct->ETH_RxDMABurstLength | /* !! if 4xPBL is selected for Tx or Rx it is applied for the other */
//						ETH_InitStruct->ETH_TxDMABurstLength |
//						(ETH_InitStruct->ETH_DescriptorSkipLength << 2) |
//						ETH_InitStruct->ETH_DMAArbitration |
//						ETH_DMABMR_USP); /* Enable use of separate PBL for Rx and Tx */

	/* Wait until the write operation will be taken into account :
	at least four TX_CLK/RX_CLK clock cycles */
//	tmpreg = ETH->DMABMR;
//	_eth_delay_(ETH_REG_WRITE_DELAY);
//	ETH->DMABMR = tmpreg;



	#ifdef USE_ENHANCED_DMA_DESCRIPTORS
	  /* Enable the Enhanced DMA descriptors */
	  ETH->DMABMR |= ETH_DMABMR_EDE;

	  /* Wait until the write operation will be taken into account :
	   at least four TX_CLK/RX_CLK clock cycles */
	  tmpreg = ETH->DMABMR;
	  _eth_delay_(ETH_REG_WRITE_DELAY);
	  ETH->DMABMR = tmpreg;
	#endif /* USE_ENHANCED_DMA_DESCRIPTORS */

//	/* Return Ethernet configuration success */
//	if(err == ETH_SUCCESS)
//	{
//		/* Return Ethernet configuration success */
//		return ETH_SUCCESS;
//	}
//	else /* Auto-negotiation failed */
//	{
//		/* Return Ethernet error */
//		return ETH_ERROR;
//	}

#endif


