leihen0525/Master.Drivers.STM32F407/Drivers.STM32F407.Ether/Drivers.STM32F4xx.Ether.MAC.c
}


void Drivers_STM32F4xx_Ether_MAC_Software_Reset(void)
{
	/* Software reset */
	ETH->DMABMR_BIT.SR=1;

	/* Wait for software reset */
	while(ETH->DMABMR_BIT.SR!=0);
}

void Drivers_STM32F4xx_Ether_MAC_SET_MAC_Address(uint8_t *MAC_Address)
{
	ETH->MACA0LR_BIT.MAC_ADDR0=MAC_Address[0];
	ETH->MACA0LR_BIT.MAC_ADDR1=MAC_Address[1];
	ETH->MACA0LR_BIT.MAC_ADDR2=MAC_Address[2];
	ETH->MACA0LR_BIT.MAC_ADDR3=MAC_Address[3];

	ETH->MACA0HR_BIT.MAC_ADDR4=MAC_Address[4];
	ETH->MACA0HR_BIT.MAC_ADDR5=MAC_Address[5];
}

void Drivers_STM32F4xx_Ether_MAC_SET_MAC_Start(void)
{
	ETH->MACCR_BIT.TE=1;
	ETH->MACCR_BIT.RE=1;

	ETH->DMAOMR_BIT.FTF=1;

	ETH->DMAOMR_BIT.ST=1;

	ETH->DMAOMR_BIT.SR=1;
}
void Drivers_STM32F4xx_Ether_MAC_SET_MAC_Stop(void)
{
	ETH->DMAOMR_BIT.ST=0;
	ETH->DMAOMR_BIT.SR=0;
	ETH->MACCR_BIT.RE=0;
	ETH->DMAOMR_BIT.FTF=1;
	ETH->MACCR_BIT.TE=0;
}
void Drivers_STM32F4xx_Ether_MAC_SET_MAC_10M_HalfDuplex(void)
{
	ETH->MACCR_BIT.FES=0;
	ETH->MACCR_BIT.DM=0;
}
void Drivers_STM32F4xx_Ether_MAC_SET_MAC_100M_HalfDuplex(void)
{
	ETH->MACCR_BIT.FES=1;
	ETH->MACCR_BIT.DM=0;
}
void Drivers_STM32F4xx_Ether_MAC_SET_MAC_10M_FullDuplex(void)
{
	ETH->MACCR_BIT.FES=0;
	ETH->MACCR_BIT.DM=1;
}
void Drivers_STM32F4xx_Ether_MAC_SET_MAC_100M_FullDuplex(void)
{
	ETH->MACCR_BIT.FES=1;
	ETH->MACCR_BIT.DM=1;
}


void ETH_DMATxDescChainInit(void)
{
	uint32_t i = 0;
	ETH_DMADESCTypeDef *DMATxDesc;

	/* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
	//DMATxDescToSet = DMATxDscrTab;
	/* Fill each DMATxDesc descriptor with the right values */
	for(i=0; i < ETH_TXBUFNB; i++)
	{
		/* Get the pointer on the ith member of the Tx Desc list */
		DMATxDesc = DMATxDscrTab + i;
		/* Set Second Address Chained bit */
		DMATxDesc->DES0 = ETH_DMATxDesc_TCH;

		/* Set Buffer1 address pointer */
		DMATxDesc->Buffer1Addr = (uint32_t)(&Tx_Buff[i][0]);

		/* Initialize the next descriptor with the Next Descriptor Polling Enable */
		if(i < (ETH_TXBUFNB-1))
		{
			/* Set next descriptor address register with next descriptor base address */
			DMATxDesc->Buffer2NextDescAddr = (uint32_t)(DMATxDscrTab+i+1);
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first descriptor base address */
			DMATxDesc->Buffer2NextDescAddr = (uint32_t) DMATxDscrTab;
		}
	}

	/* Set Transmit Desciptor List Address Register */
	ETH->DMATDLAR = (uint32_t) DMATxDscrTab;
}

void ETH_DMARxDescChainInit(void)
{
	uint32_t i = 0;
	ETH_DMADESCTypeDef *DMARxDesc;

	/* Set the DMARxDescToGet pointer with the first one of the DMARxDescTab list */
	//DMARxDescToGet = DMARxDescTab;
	/* Fill each DMARxDesc descriptor with the right values */
	for(i=0; i < ETH_RXBUFNB; i++)
	{
		/* Get the pointer on the ith member of the Rx Desc list */
		DMARxDesc = DMARxDscrTab+i;
		/* Set Own bit of the Rx descriptor Status */
		DMARxDesc->DES0 = ETH_DMARxDesc_OWN;

		/* Set Buffer1 size and Second Address Chained bit */
		//DMARxDesc->ControlBufferSize = ETH_DMARxDesc_RCH | (uint32_t)ETH_RX_BUF_SIZE;
		DMARxDesc->DES1_BIT.Rx.RBS1=(uint32_t)ETH_RX_BUF_SIZE;
		DMARxDesc->DES1_BIT.Rx.RCH=1;

		/* Set Buffer1 address pointer */
		DMARxDesc->Buffer1Addr = (uint32_t)(&Rx_Buff[i][0]);

		/* Initialize the next descriptor with the Next Descriptor Polling Enable */
		if(i < (ETH_RXBUFNB-1))
		{
			/* Set next descriptor address register with next descriptor base address */
			DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDscrTab+i+1);
		}
		else
		{
			/* For last descriptor, set next descriptor address register equal to the first descriptor base address */
			DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDscrTab);
		}
	}

	/* Set Receive Descriptor List Address Register */
	ETH->DMARDLAR = (uint32_t) DMARxDscrTab;

	//DMA_RX_FRAME_infos = &RX_Frame_Descriptor;

}

